let lista = ["Banana", 20, 33.983, "Maçã", false]; //Declaração e inicialização de um array
console.log("1: " + lista);
/*----------------------------------------------------------------------------------------------------------------------*/
lista = ["banana", "laranja", "abacate"]; //Reatribuindo valores a lista
console.log("2: " + lista);
/*----------------------------------------------------------------------------------------------------------------------*/
console.log("3: " + lista[0]); //Acessando o valor de uma posição na lista
/*----------------------------------------------------------------------------------------------------------------------*/
lista[0] = "goiaba"; //Alterando o valor de uma posição da lista
console.log("4: " + lista[0]);
console.log("5: " + lista);
/*----------------------------------------------------------------------------------------------------------------------*/
lista[3] = "jabuticaba"; //Adicionando um novo valor a lista
console.log("6: " + lista);
/*----------------------------------------------------------------------------------------------------------------------*/
console.log(lista.length); //Propriedade que exibe o tamanho da lista
/*----------------------------------------------------------------------------------------------------------------------*/
